class_name TileNameRulePreset_Basic
extends ConfigBase

"""
rule_name
values 每条对应一个 TileNameRulePreset 实例：
    [rule_name, tiles_name]
tiles_name：二维数组，元素可为字符串（该位置 tile 名）或 [组名, [H, W]]（一组多格，H高 W宽）。
"""
var values: Array[Array] = [
    ["BlockRule", [
        ["M", "L3210", "R3210", "DL3210", "DR3210"],
        ["DM", "L10", "L21", "L32", "L43"],
        ["FULL", "R43", "R32", "R21", "R10"],
        ]],

    ["PlantRule", [
        [["1", [32,32]]],
        [["2", [32,32]]],
        [["3", [32,32]]],
        [["4", [32,32]]],
        [["4", [32,32]]],
        [["5", [32,32]]],
        [["5", [32,32]]],
        [["6", [32,32]]],
        [["6", [32,32]]],
        [["6", [32,32]]],
        ]],

    ["DoorRule", [
        [["1", [48,48]]],
        [["1", [32,48]]],
        [["1", [32,48]]],
        [["2", [48,32]], ["2", [48,48]]],
        [["2", [32,32]], ["2", [32,48]]],
        [["2", [32,32]], ["2", [32,48]]],
        ]],
]
